Revit 2026 API

# ZoomType Enumeration

---

An enumerated type listing all Zoom types of Print Setting.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum ZoomType
```
```vb
Public Enumeration ZoomType
```
```cpp
public enum class ZoomType
```
```fsharp
type ZoomType
```

| Member name | Value | Description |
| --- | --- | --- |
| FitToPage | 0 | The type of Zoom is Fit To Page. |
| Zoom | 1 | The type of Zoom is user defined. |

#### Reference

Autodesk.Revit.DB Namespace